# Pandas @Kaggle

### Let us employ our new found powers to a Kaggle Competition

## First setup check

In [46]:
import pandas as pd
print('pandas: ',pd.__version__)

pandas:  1.3.4

## Read Test & Train for the Titanic Competition

In [47]:
import datetime
from pytz import timezone
print("Last run @%s" % (datetime.datetime.now(timezone('US/Pacific'))))

Last run @2022-01-24 15:29:29.950019-08:00

In [48]:
df_train = pd.read_csv('data/titanic/train.csv')
df_test = pd.read_csv('data/titanic/test.csv')

In [49]:
df_train['Age'].unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [50]:
df_train.count() # non-NA counts

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [64]:
df_test.count() #Test data set

PassengerId    418
Pclass         418
Name           418
Sex            418
Age            332
SibSp          418
Parch          418
Ticket         418
Fare           417
Cabin           91
Embarked       418
dtype: int64

In [51]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [65]:
df_test.head() # different column: Survived

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [66]:
df_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [67]:
df_test.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

Let's see if gender made a difference in survival statistics

In [53]:
df_train.groupby(['Sex','Survived']).count()#[['Survived','Sex']] .size()

                 PassengerId  Pclass  Name  Age  SibSp  Parch  Ticket  Fare  \
Sex    Survived
female 0                  81      81    81   64     81     81      81    81
       1                 233     233   233  197    233    233     233   233
male   0                 468     468   468  360    468    468     468   468
       1                 109     109   109   93    109    109     109   109

                 Cabin  Embarked
Sex    Survived
female 0             6        81
       1            91       231
male   0            62       468
       1            45       109

In [54]:
by_gender = df_train.groupby(['Sex','Survived']).size().unstack()
#by_gender.columns[1] = "Dead"
by_gender

Survived    0    1
Sex
female     81  233
male      468  109

In [55]:
by_gender.columns[0]

0

In [56]:
by_gender.rename(index=str,columns={0:"Dead",1:"Live"})

Survived  Dead  Live
Sex
female      81   233
male       468   109

In [57]:
by_gender[0]

Sex
female     81
male      468
Name: 0, dtype: int64

In [58]:
by_gender['Total'] = by_gender[0] + by_gender[1]
by_gender

Survived    0    1  Total
Sex
female     81  233    314
male      468  109    577

In [59]:
by_gender['Percent'] = (by_gender[1] / by_gender['Total']) * 100
by_gender

Survived    0    1  Total    Percent
Sex
female     81  233    314  74.203822
male      468  109    577  18.890815

In [60]:
print("F-Survived   = %2.2f %%" % ( (233.0/(81+233))*100 ))
print("M-Survived   = %2.2f %%" % ( (109.0/(468+109))*100 ))
print("All-Survived = %2.2f %%" % ( ((233.0+109)/(81+233+468+109))*100 ))
print("All-Not Survived = %2.6f %%" % (100-(((233.0+109)/(81+233+468+109))*100)))

F-Survived   = 74.20 %
M-Survived   = 18.89 %
All-Survived = 38.38 %
All-Not Survived = 61.616162 %

In [61]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [62]:
pd.crosstab(df_train["Sex"],df_train["Survived"])# equivalent to groupby and unstack

Survived    0    1
Sex
female     81  233
male      468  109

In [69]:
#df_test.head()#Moved this up to the top where it made more sense

In [70]:
#df_test.count() #Moved this up to the top where it made more sense

## #1 : Simple Model (M=Survived)

In [71]:
gender_model = lambda row: [0,1] [row['Sex'] == 'male']
df_test['Survived'] = df_test.apply(gender_model,axis=1)
# This was an error. I thought I was doing F=Survived ! Anyway, I let it stand

In [72]:
df_test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,1
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,1
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,0
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,1
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,1
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,1

In [40]:
df_test[['PassengerId','Survived']].to_csv('data/titanic/sub-01.csv', index=False, float_format="%f")

# Submit and you will get 0.23445 & be ridiculed forever ;o(

In [41]:
df_test.groupby(['Sex','Survived']).size().unstack()

Survived      0      1
Sex
female    152.0    NaN
male        NaN  266.0

## #2 : Simple Model (F=Survived)

In [ ]:
gender_model = lambda row: [1,0] [row['Sex'] == 'male']
df_test['Survived'] = df_test.apply(gender_model,axis=1)
#df_test.head() # Now I got it right !

In [ ]:
df_test[['PassengerId','Survived']].to_csv('data/titanic/sub-02.csv', index=False, float_format="%f")
# Submit and you will get 0.76555

In [ ]:
df_test.groupby(by=['Sex','Survived']).size().unstack()

##### Exercise #1: See if PClass, SibSp or Parch is a better indication and change survival accordingly

## Now clean the data for applying tree algorithms

In [ ]:
df_train.drop(['Ticket','Cabin','Embarked','Age','Name'],inplace=True,axis=1)

In [ ]:
df_train.head()

In [ ]:
gender_code = lambda row: [1,0] [row['Sex'] == 'male']
df_train['Gender'] = df_train.apply(gender_code,axis=1)

In [ ]:
df_train.head()

In [ ]:
df_train.drop('Sex',inplace=True,axis=1)

In [ ]:
df_train.head()

## #3 : Simple CART Model

In [ ]:
from sklearn.tree import DecisionTreeClassifier
import numpy as np
clf = DecisionTreeClassifier() #Default Values incl criterion='gini'; could be critirion='entropy'

In [ ]:
clf_data = df_train[['Pclass','SibSp','Parch','Fare','Gender']].values
clf_target = df_train.Survived.values

In [ ]:
clf = clf.fit(clf_data,clf_target)

#### Now, transform the test data

In [ ]:
df_test.drop(['Ticket','Cabin','Embarked','Age','Name'],inplace=True,axis=1)
df_test.head(n=1)

In [ ]:
gender_code = lambda row: [1,0] [row['Sex'] == 'male']
df_test['Gender'] = df_test.apply(gender_code,axis=1)

In [ ]:
df_test.head(n=1)

In [ ]:
df_test.drop('Sex',inplace=True,axis=1)
df_test.head(n=1)

In [ ]:
clf_test_data = df_test[['Pclass','SibSp','Parch','Fare','Gender']].values
#use numpy method to drop row with NaN
clf_test_predict = clf.predict(clf_test_data[~np.isnan(clf_test_data).any(axis=1)])

In [ ]:
df_test.count()

In [ ]:
df_test.describe()

In [ ]:
df_test_1 = df_test.fillna(35) # might be better to filin with average

In [ ]:
clf_test_data = df_test_1[['Pclass','SibSp','Parch','Fare','Gender']].values
clf_test_predict = clf.predict(clf_test_data)

In [ ]:
df_test_1.head()

In [ ]:
change_predict = clf_test_predict != df_test_1['Survived']

In [ ]:
change_predict.mean()

In [ ]:
df_test_1['Survived'] = clf_test_predict

In [ ]:
df_test_1[['PassengerId','Survived']].to_csv('data/titanic/sub-03.csv', index=False, float_format="%f")
# Submit and you will get 0.75120/0.74163/..

## #4 : Random Forest Model

In [ ]:
from sklearn.ensemble import RandomForestClassifier

In [ ]:
clf = RandomForestClassifier(n_estimators=10)

In [ ]:
clf = clf.fit(clf_data,clf_target)

In [ ]:
clf_test_predict = clf.predict(clf_test_data)

In [ ]:
df_test_1['Survived'] = clf_test_predict

In [ ]:
df_test_1[['PassengerId','Survived']].to_csv('data/titanic/sub-04.csv', index=False, float_format="%f")
# Submit and you will get 0.75598/0.76077

In [ ]:
clf = RandomForestClassifier(n_estimators=100)
clf = clf.fit(clf_data,clf_target)
clf_test_predict = clf.predict(clf_test_data)
df_test_1['Survived'] = clf_test_predict
df_test_1[['PassengerId','Survived']].to_csv('data/titanic/sub-05.csv', index=False, float_format="%f")
# Submit and you will still get 0.75598/0.76555-improved second try
# RF needs more features. We have only 5

## #5 : SVM

In [ ]:
from sklearn.svm import SVC

In [ ]:
clf = SVC(gamma='scale') # kernel = 'rbf' Radial Basis Function
clf = clf.fit(clf_data,clf_target)
clf_test_predict = clf.predict(clf_test_data)
df_test_1['Survived'] = clf_test_predict
df_test_1[['PassengerId','Survived']].to_csv('data/titanic/sub-06.csv', index=False, float_format="%f")
# Submit and you will still get 0.74641

In [ ]:
clf = SVC(kernel = "linear")
clf = clf.fit(clf_data,clf_target)
clf_test_predict = clf.predict(clf_test_data)
df_test_1['Survived'] = clf_test_predict
df_test_1[['PassengerId','Survived']].to_csv('data/titanic/sub-07.csv', index=False, float_format="%f")
# Submit and you will still get 0.76555

In [ ]:
clf = SVC(kernel = "sigmoid", gamma='scale')
clf = clf.fit(clf_data,clf_target)
clf_test_predict = clf.predict(clf_test_data)
df_test_1['Survived'] = clf_test_predict
df_test_1[['PassengerId','Survived']].to_csv('data/titanic/sub-08.csv', index=False, float_format="%f")
# Submit and you will still get 0.62679

## Homework

1. How many of each gender survived ? Answered
2. Did age make any difference ? 
    - Hint : Use cut to stratify
3. Did passengers travelling with spouses/siblings have a better chance of survival ?

### _That is ALL Folks !_